; domain
(define (domain IMAGINE)
(:requirements :adl :equality :action-costs)
(:types struct side tool - object)
(:predicates (precedes ?x ?y - struct)
             (reachable ?x - struct ?y - side)
             (removable ?x - struct)
             (removed ?x - struct)
             (current-side ?x - side)
             (current-tool ?x - tool)
             (usable-tool ?x - tool ?y - struct)
)
(:functions
  (total-cost)
  (remove-cost ?tool - tool ?x - struct)
  (flip-cost)
  (switch-tool-cost)
)

(:action remove
 :parameters (?what - struct ?where - side ?tool - tool)
 :precondition (and
  (removable ?what)
  (not (removed ?what))
  (forall (?other - struct) (not (precedes ?other ?what)))
  (reachable ?what ?where)
  (current-side ?where)
  (current-tool ?tool)
  (usable-tool ?tool ?what)
 )
 :effect (and
  (removed ?what)
  (forall (?other - struct) (not (precedes ?what ?other)))
  (increase (total-cost) (remove-cost ?tool ?what)))
)

(:action flip
 :parameters (?current-side ?desired-side - side)
 :precondition (and
  (not (= ?current-side ?desired-side))
  (current-side ?current-side)
 )
 :effect (and
  (not (current-side ?current-side))
  (current-side ?desired-side)
  (increase (total-cost) (flip-cost)))
)

(:action switch-tool
 :parameters (?current-tool ?desired-tool - tool)
 :precondition (and
  (not (= ?current-tool ?desired-tool))
  (current-tool ?current-tool)
 )
 :effect (and
  (not (current-tool ?current-tool))
  (current-tool ?desired-tool)
  (increase (total-cost) (switch-tool-cost)))
)

)

; problem
(define (problem p0)
  (:domain IMAGINE)
  (:objects
    pcb lid actuator screw0 screw1 screw2 - struct
    top bottom - side
    screwdriver-flat screwdriver-torx8 suction-pad none - tool
  )
  (:init
   (removable pcb)
   (removable lid)
   (removable actuator)
   (removable screw0)
   (removable screw1)
   (removable screw2)
   
   (precedes pcb screw2)
   (precedes lid actuator)
   (precedes screw0 pcb)
   (precedes screw1 lid)
   (precedes screw2 actuator)

   (reachable pcb bottom)
   (reachable lid top)
   (reachable actuator top)
   (reachable screw0 bottom)
   (reachable screw1 top)
   (reachable screw2 bottom)

   (current-side top)
   (current-tool none)

   (usable-tool screwdriver-flat pcb)
   (usable-tool suction-pad pcb)
   (usable-tool screwdriver-flat lid)
   (usable-tool suction-pad lid)
   (usable-tool screwdriver-flat actuator)
   (usable-tool screwdriver-torx8 screw0)
   (usable-tool screwdriver-torx8 screw1)
   (usable-tool screwdriver-torx8 screw2)

   (= (total-cost) 0)

   (= (remove-cost screwdriver-flat pcb) 1)
   (= (remove-cost suction-pad pcb) 4)
   (= (remove-cost screwdriver-flat lid) 4)
   (= (remove-cost suction-pad lid) 1)
   (= (remove-cost screwdriver-flat actuator) 2)
   (= (remove-cost screwdriver-torx8 screw0) 1)
   (= (remove-cost screwdriver-torx8 screw1) 1)
   (= (remove-cost screwdriver-torx8 screw2) 1)

   (= (flip-cost) 1)
   (= (switch-tool-cost) 1)
  )
  (:goal (and (removed pcb) (removed lid) (removed actuator)))
  ;(:goal (and (removed screw0)))
  ;(:goal (and (current-tool screwdriver-flat)))
  (:metric minimize (total-cost))
)

; plan
1. (switch-tool none screwdriver-torx8)
   deleted: (current-tool none)
   added: (current-tool screwdriver-torx8)
   goals met: 0 of 3
2. (remove screw1 top screwdriver-torx8)
   deleted: (precedes screw1 lid)
   added: (removed screw1)
   goals met: 0 of 3
3. (flip top bottom)
   deleted: (current-side top)
   added: (current-side bottom)
   goals met: 0 of 3
4. (remove screw0 bottom screwdriver-torx8)
   deleted: (precedes screw0 pcb)
   added: (removed screw0)
   goals met: 0 of 3
5. (switch-tool screwdriver-torx8 screwdriver-flat)
   deleted: (current-tool screwdriver-torx8)
   added: (current-tool screwdriver-flat)
   goals met: 0 of 3
6. (remove pcb bottom screwdriver-flat)
   deleted: (precedes pcb screw2)
   added: (removed pcb)
   goals met: 1 of 3
7. (switch-tool screwdriver-flat screwdriver-torx8)
   deleted: (current-tool screwdriver-flat)
   added: (current-tool screwdriver-torx8)
   goals met: 1 of 3
8. (remove screw2 bottom screwdriver-torx8)
   deleted: (precedes screw2 actuator)
   added: (removed screw2)
   goals met: 1 of 3
9. (switch-tool screwdriver-torx8 suction-pad)
   deleted: (current-tool screwdriver-torx8)
   added: (current-tool suction-pad)
   goals met: 1 of 3
10. (flip bottom top)
   deleted: (current-side bottom)
   added: (current-side top)
   goals met: 1 of 3
11. (remove lid top suction-pad)
   deleted: (precedes lid actuator)
   added: (removed lid)
   goals met: 2 of 3
12. (switch-tool suction-pad screwdriver-flat)
   deleted: (current-tool suction-pad)
   added: (current-tool screwdriver-flat)
   goals met: 2 of 3
13. (remove actuator top screwdriver-flat)
   added: (removed actuator)
   goals met: 3 of 3
